; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v11 ?v9)
             (pred_12 ?v8 ?v13)
             (pred_3 ?v11 ?v13)
             (pred_4 ?v12 ?v11 )
	     (pred_10 ?v11)
             (pred_7 ?v5)
             (pred_9 ?v8)
             (pred_8 ?v13)
             (pred_2 ?v11)
             (pred_6 ?v8)
             (pred_1 ?v11)
             (pred_5 ))



(:action op_5
:parameters (?v6 ?v2 ?v4 ?v3)
:precondition (and (pred_7 ?v6) (pred_7 ?v2) (pred_9 ?v4) (pred_8 ?v3)
          (pred_11 ?v6 ?v2) (pred_12 ?v4 ?v3)
                   (pred_3 ?v2 ?v3) (pred_10 ?v6) 
                   (pred_2 ?v2) (pred_6 ?v4))
:effect (and  (pred_1 ?v2) (not (pred_2 ?v2))))


(:action op_2
:parameters (?v6 ?v10)
:precondition (and (pred_7 ?v6) (pred_7 ?v10)
               (pred_10 ?v6) (pred_11 ?v6 ?v10) (pred_1 ?v10))
:effect (and (pred_10 ?v10) (not (pred_10 ?v6))))

(:action op_4
:parameters (?v6 ?v4)
:precondition (and (pred_7 ?v6) (pred_9 ?v4) 
                  (pred_10 ?v6) (pred_4 ?v4 ?v6) (pred_5 ))
:effect (and (pred_6 ?v4)
   (not (pred_4 ?v4 ?v6)) (not (pred_5 ))))


(:action op_1
:parameters (?v6 ?v1 ?v7)
:precondition (and (pred_7 ?v6) (pred_9 ?v1) (pred_9 ?v7)
                  (pred_10 ?v6) (pred_6 ?v7) (pred_4 ?v1 ?v6))
:effect (and (pred_6 ?v1) (pred_4 ?v7 ?v6)
        (not (pred_6 ?v7)) (not (pred_4 ?v1 ?v6))))

(:action op_3
:parameters (?v6 ?v4)
:precondition (and (pred_7 ?v6) (pred_9 ?v4) 
                  (pred_10 ?v6) (pred_6 ?v4))
:effect (and (pred_5 ) (pred_4 ?v4 ?v6) (not (pred_6 ?v4)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_04 obj_01 obj_11 obj_06 obj_13 obj_07 obj_22 obj_02 obj_09 obj_18 obj_19 obj_17 obj_16 obj_10 obj_03 obj_08
    obj_12 obj_21 obj_20
    obj_15 obj_05 obj_14
    )

    (:init
       (pred_5)

       (pred_7 obj_04)
       (pred_7 obj_01)
       (pred_7 obj_11)
       (pred_7 obj_06)
       (pred_7 obj_13)
       (pred_7 obj_07)
       (pred_7 obj_22)
       (pred_7 obj_02)
       (pred_7 obj_09)
       (pred_7 obj_18)
       (pred_7 obj_19)
       (pred_7 obj_17)
       (pred_7 obj_16)
       (pred_7 obj_10)
       (pred_7 obj_03)
       (pred_7 obj_08)
       (pred_8 obj_12)
       (pred_8 obj_21)
       (pred_8 obj_20)
       (pred_9 obj_15)
       (pred_9 obj_05)
       (pred_9 obj_14)

       (pred_11 obj_04 obj_13)
       (pred_11 obj_04 obj_01)
       (pred_11 obj_01 obj_07)
       (pred_11 obj_01 obj_11)
       (pred_11 obj_01 obj_04)
       (pred_11 obj_11 obj_22)
       (pred_11 obj_11 obj_06)
       (pred_11 obj_11 obj_01)
       (pred_11 obj_06 obj_02)
       (pred_11 obj_06 obj_11)
       (pred_11 obj_13 obj_09)
       (pred_11 obj_13 obj_07)
       (pred_11 obj_13 obj_04)
       (pred_11 obj_07 obj_18)
       (pred_11 obj_07 obj_22)
       (pred_11 obj_07 obj_01)
       (pred_11 obj_07 obj_13)
       (pred_11 obj_22 obj_19)
       (pred_11 obj_22 obj_02)
       (pred_11 obj_22 obj_11)
       (pred_11 obj_22 obj_07)
       (pred_11 obj_02 obj_17)
       (pred_11 obj_02 obj_06)
       (pred_11 obj_02 obj_22)
       (pred_11 obj_09 obj_16)
       (pred_11 obj_09 obj_18)
       (pred_11 obj_09 obj_13)
       (pred_11 obj_18 obj_10)
       (pred_11 obj_18 obj_19)
       (pred_11 obj_18 obj_07)
       (pred_11 obj_18 obj_09)
       (pred_11 obj_19 obj_03)
       (pred_11 obj_19 obj_17)
       (pred_11 obj_19 obj_22)
       (pred_11 obj_19 obj_18)
       (pred_11 obj_17 obj_08)
       (pred_11 obj_17 obj_02)
       (pred_11 obj_17 obj_19)
       (pred_11 obj_16 obj_10)
       (pred_11 obj_16 obj_09)
       (pred_11 obj_10 obj_03)
       (pred_11 obj_10 obj_18)
       (pred_11 obj_10 obj_16)
       (pred_11 obj_03 obj_08)
       (pred_11 obj_03 obj_19)
       (pred_11 obj_03 obj_10)
       (pred_11 obj_08 obj_17)
       (pred_11 obj_08 obj_03)
       (pred_2 obj_11)
       (pred_2 obj_02)
       (pred_2 obj_07)
       (pred_3  obj_11 obj_12)
       (pred_3  obj_02 obj_21)
       (pred_3  obj_07 obj_20)
       (pred_1 obj_04)
       (pred_1 obj_01)
       (pred_1 obj_06)
       (pred_1 obj_13)
       (pred_1 obj_22)
       (pred_1 obj_09)
       (pred_1 obj_18)
       (pred_1 obj_19)
       (pred_1 obj_17)
       (pred_1 obj_16)
       (pred_1 obj_10)
       (pred_1 obj_03)
       (pred_1 obj_08)

       (pred_12  obj_15 obj_12)
       (pred_12  obj_05 obj_21)
       (pred_12  obj_14 obj_20)
       (pred_4 obj_15 obj_18)
       (pred_4 obj_05 obj_08)
       (pred_4 obj_14 obj_19)
       (pred_10 obj_18)
    )

    (:goal (and
       (pred_4 obj_05 obj_13)
    ))
(:constraints
  (always (not (pred_10 obj_17)))
)
)

; plan
1. (op_2 obj_18 obj_19)
   deleted: (pred_10 obj_18)
   added: (pred_10 obj_19)
   goals met: 0 of 1
2. (op_2 obj_19 obj_03)
   deleted: (pred_10 obj_19)
   added: (pred_10 obj_03)
   goals met: 0 of 1
3. (op_2 obj_03 obj_08)
   deleted: (pred_10 obj_03)
   added: (pred_10 obj_08)
   goals met: 0 of 1
4. (op_4 obj_08 obj_05)
   deleted: (pred_4 obj_05 obj_08) (pred_5)
   added: (pred_6 obj_05)
   goals met: 0 of 1
5. (op_2 obj_08 obj_03)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_03)
   goals met: 0 of 1
6. (op_2 obj_03 obj_19)
   deleted: (pred_10 obj_03)
   added: (pred_10 obj_19)
   goals met: 0 of 1
7. (op_2 obj_19 obj_18)
   deleted: (pred_10 obj_19)
   added: (pred_10 obj_18)
   goals met: 0 of 1
8. (op_2 obj_18 obj_09)
   deleted: (pred_10 obj_18)
   added: (pred_10 obj_09)
   goals met: 0 of 1
9. (op_2 obj_09 obj_13)
   deleted: (pred_10 obj_09)
   added: (pred_10 obj_13)
   goals met: 0 of 1
10. (op_3 obj_13 obj_05)
   deleted: (pred_6 obj_05)
   added: (pred_5) (pred_4 obj_05 obj_13)
   goals met: 1 of 1
